app/controllers/user_episodes_controller.rb

    def create
        # {
        #     "user_id": 1,
        #     "episdoe_id": 5,
        # }
        user_episode=UserEpisode.create(user_id: params["user_id"].to_i, episode_id: params["episode_id"].to_i)
---
INSERT INTO "user_episodes" ("episode_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["episode_id", 1], ["user_id", 1], ["created_at", "2020-05-03 17:22:24.723030"], ["updated_at", "2020-05-03 17:22:24.723030"]]

      def destroy
        user_ep = UserEpisode.find(params[:id])
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]